In [2]:
import pandas as pd
data = pd.read_csv("Book1.csv")
data.head()

  Name  Math  Chemistry  Maths  Physics  English  General Test
0    A    70         60     70       50       75            80
1    B    60         80     60       45       25            80
2    C    40         65     40       60       40            80
3    D    80         55     80       60       67            80
4    E    30         40     30       39       88            80

In [3]:
data.shape

(11, 7)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          11 non-null     object
 1   Math          11 non-null     int64
 2   Chemistry     11 non-null     int64
 3   Maths         11 non-null     int64
 4   Physics       11 non-null     int64
 5   English       11 non-null     int64
 6   General Test  11 non-null     int64
dtypes: int64(6), object(1)
memory usage: 744.0+ bytes

In [9]:
features = data.drop("Name",axis = 1)

In [10]:
features.head()

   Math  Chemistry  Maths  Physics  English  General Test
0    70         60     70       50       75            80
1    60         80     60       45       25            80
2    40         65     40       60       40            80
3    80         55     80       60       67            80
4    30         40     30       39       88            80

In [11]:
from sklearn.feature_selection import VarianceThreshold
selector = VarianceThreshold(threshold = 0)
selected_features = selector.fit_transform(features)

In [12]:
selected_features

array([[70, 60, 70, 50, 75],
       [60, 80, 60, 45, 25],
       [40, 65, 40, 60, 40],
       [80, 55, 80, 60, 67],
       [30, 40, 30, 39, 88],
       [50, 60, 50, 50, 23],
       [50, 60, 50, 68, 40],
       [78, 85, 78, 50, 70],
       [26, 40, 26, 50, 70],
       [59, 70, 59, 60, 55],
       [89, 73, 89, 70, 79]], dtype=int64)

In [14]:
data = pd.DataFrame(selected_features,columns = selector.get_feature_names_out())

In [15]:
data.head()

   Math  Chemistry  Maths  Physics  English
0    70         60     70       50       75
1    60         80     60       45       25
2    40         65     40       60       40
3    80         55     80       60       67
4    30         40     30       39       88